---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.CloudExternalService
source: html/5219470f-eb9f-0a96-1301-94e34152b8a6.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.CloudExternalService Property

The external service which supports get cloud model information from cloud servers such as C4R.

## Syntax (C#)
```csharp
public static ExternalServiceId CloudExternalService { get; }
```